{
    "uuid": [
        {
            "value": "316405b4-4a96-4ba0-aa2c-5ee0a9151894"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "article",
            "target_type": "node_type",
            "target_uuid": "32405006-8647-4ee2-b3e5-746ea6770c76"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2019-08-11T02:27:40+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "6ba5544e-532f-4e41-8872-dd0929140585"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "title": [
        {
            "value": "Let's hear it for carrots"
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "6ba5544e-532f-4e41-8872-dd0929140585"
        }
    ],
    "created": [
        {
            "value": "2019-08-11T02:27:40+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2019-08-11T02:27:40+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": true
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "moderation_state": [
        {
            "value": "published"
        }
    ],
    "path": [
        {
            "alias": "\/articles\/lets-hear-it-for-carrots",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<p>Let's hear it for the humble carrot! This sweet and healthy &lsquo;everyday&rsquo; veg packs it all in. Great flavor, fantastic color, and if you're one for believing the old story, they can even help you to see better in the dark.<\/p>\n<p>Who doesn't love cooking with this super versatile root veg? We roast them, boil them, blend them into soups, and grate them into salads. The humble carrot has to be one of our favorite veg choices and it's been grown for thousands of years. But back then you were more likely to find a purple, red, yellow or white carrot and not the orange one we are all so familiar with today.<\/p>\n<h2>So what happened? When did orange become the preferred color?<\/h2>\n<p>It was the Dutch during the 17th century who cultivated and made popular the orange variety, most likely because of its brilliant color and higher levels of beta carotene. And it has also been suggested that they were cultivated in tribute to William of Orange, who led the struggle during the Dutch battle for independence.<\/p>\n<p>For whatever reason, the orange variety has stuck but look out for the &lsquo;heritage&rsquo; varieties at farmers markets and grocers, their mix of purple, yellow, orange and white are especially appealing to cook with and look absolutely great served as a side dish.<\/p>\n<h2>Nutrition<\/h2>\n<p>Carrots are rich in beta carotene which your body converts into vitamin A. It's often tricky to know whether cooking vegetables will enhance or reduce their nutritious value and unfortunately there's no simple rule. But in the case of carrots, nutrition is enhanced by consuming them cooked. In fact, it only takes 100 grams of carrots to get more than your daily value of vitamin A.<\/p>\n<h2>Get them at their best<\/h2>\n<p>Young carrots, harvested when they are small have an especially sweet flavor and they are absolutely delicious. To cook them you can skip the peeling, give them a good wash and pop them in the steamer for just a few minutes. Carrots will taste the best when they are fresh, so make sure they are firm and bright in color when buying.<\/p>\n<h2>And that thing about carrots helping you see more in the dark?<\/h2>\n<p>Of course it's a myth. During World War II the UK Ministry of Food promoted carrots as a super healthy veggie that would improve your ability to see during the blackouts and as an explanation for the successful night missions of UK fighter pilots. In reality, the only truth in the connection between carrots and improved eye sight is that vitamin A does indeed help to maintain vision.<\/p>\n",
            "format": "basic_html",
            "summary": null
        }
    ],
    "field_image": [
        {
            "alt": "Purple, orange, yellow and white heritage carrots.",
            "title": null,
            "width": 768,
            "height": 511,
            "target_type": "file",
            "target_uuid": "cc88bdc5-fba9-4445-ace2-2d676fbb53d1"
        }
    ],
    "field_tags": [
        {
            "target_type": "taxonomy_term",
            "target_uuid": "d01c5065-f4c5-4058-986f-5b48f263fc56"
        },
        {
            "target_type": "taxonomy_term",
            "target_uuid": "cc28a0a2-147a-4fc6-bb20-2b4fb6dfafd3"
        },
        {
            "target_type": "taxonomy_term",
            "target_uuid": "f0a5f9b7-e933-4378-bdf3-744befa29fe2"
        }
    ]
}